--------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  N:\Paramed\Command\Paramed\Testing\paramed_changes.log
  log type:  text
 opened on:  16 Jul 2019, 16:58:51

. use paramed_example.dta, clear

. 
. *1. Reduced output
. paramed2 y_cont, avar(treat) mvar(m_bin) cvars(var1 var2) a0(0) a1(1) m(1) yreg(linear) mreg(logistic) //

Model for the outcome

      Source |       SS           df       MS      Number of obs   =     1,000
-------------+----------------------------------   F(5, 994)       =   1337.42
       Model |  217271.294         5  43454.2587   Prob > F        =    0.0000
    Residual |   32296.107       994  32.4910533   R-squared       =    0.8706
-------------+----------------------------------   Adj R-squared   =    0.8699
       Total |  249567.401       999  249.817218   Root MSE        =    5.7001

--------------------------------------------------------------------------------
        y_cont |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         treat |  -12.90945   .5110227   -25.26   0.000    -13.91226   -11.90664
         m_bin |   3.292577   .5693594     5.78   0.000     2.175292    4.409861
_treat_X_m_bin |  -22.23864   .7217306   -30.81   0.000    -23.65493   -20.82235
          var1 |   .9897736   .0606257    16.33   0.000     .8708045    1.108743
          var2 |  -1.412419   .1084454   -13.02   0.000    -1.625228   -1.199611
         _cons |   5.556967   .8206041     6.77   0.000     3.946651    7.167282
--------------------------------------------------------------------------------


Model for the mediator

Iteration 0:   log likelihood = -693.14518
Iteration 1:   log likelihood = -506.13868
Iteration 2:   log likelihood = -489.97545
Iteration 3:   log likelihood = -489.21237
Iteration 4:   log likelihood = -489.20977

Logistic regression                               Number of obs   =       1000
                                                  LR chi2(3)      =     407.87
                                                  Prob > chi2     =     0.0000
Log likelihood = -489.20977                       Pseudo R2       =     0.2942

------------------------------------------------------------------------------
       m_bin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   .0681243   .1576183     0.43   0.666    -.2408019    .3770504
        var1 |  -.0100659   .0263047    -0.38   0.702    -.0616221    .0414903
        var2 |   .8696374   .0571742    15.21   0.000     .7575781    .9816968
       _cons |  -4.242807   .4044849   -10.49   0.000    -5.035583   -3.450031
------------------------------------------------------------------------------


Estimates of causal effects

             |   Estimate     Std Err   P>|z|   [95% Conf   Interval]
-------------+-------------------------------------------------------
         cde | -35.148087   .50975379   0.000  -36.147205   -34.14897
         nde | -23.860326   .71321343   0.000  -25.258225  -22.462428
         nie | -.32263925   .74640509   0.666  -1.7855932   1.1403147
         mte | -24.182965   4.7226287   0.000  -33.439318  -14.926613

Note for outcome Y, treatment (exposure) A, and mediator M:
     controlled direct effect
          cde = E[Y(A=a, M=m)]- E[Y(A=a*, M=m)]
     natural direct effect
          nde = E[Y(A=a, M=m)]- E[Y(A=a*, M=m)]
     natural indirect effect
          nie = E[Y(A=a, M(A=a*))]- E[Y(A=a*, M(A=a*))]
     marginal total effect
          mte = E[Y(A=a, M(A=a))]- E[Y(A=a, M(A=a*))]

Where Y(A = a, M = m) is the value Y would take if the exposure is set to a
and the mediator is set to m. Y(A = a, M(A = a*)) is the value Y  would take
if the exposure is set to a and the mediator takes the vaulue it would when 
the exposure is set to a*.

. 
. *2. Full output if no covariates specified
. ***Note I have ommited a0 a1 options and command still runs***
. paramed2 y_cont, avar(treat) mvar(m_bin) cvars(var1 var2)  m(1) yreg(linear) mreg(logistic) nointer // full output
0 1

Model for the outcome

      Source |       SS           df       MS      Number of obs   =     1,000
-------------+----------------------------------   F(4, 995)       =    734.39
       Model |  186423.087         4  46605.7718   Prob > F        =    0.0000
    Residual |  63144.3133       995  63.4616214   R-squared       =    0.7470
-------------+----------------------------------   Adj R-squared   =    0.7460
       Total |  249567.401       999  249.817218   Root MSE        =    7.9663

------------------------------------------------------------------------------
      y_cont |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |  -24.05642    .504428   -47.69   0.000    -25.04628   -23.06655
       m_bin |  -7.770805   .6175511   -12.58   0.000    -8.982657   -6.558953
        var1 |   1.061264   .0846666    12.53   0.000     .8951181    1.227409
        var2 |  -1.432705   .1515573    -9.45   0.000    -1.730114   -1.135296
       _cons |   10.61264   1.123693     9.44   0.000     8.407562    12.81772
------------------------------------------------------------------------------


Model for the mediator

Iteration 0:   log likelihood = -693.14518
Iteration 1:   log likelihood = -506.13868
Iteration 2:   log likelihood = -489.97545
Iteration 3:   log likelihood = -489.21237
Iteration 4:   log likelihood = -489.20977

Logistic regression                               Number of obs   =       1000
                                                  LR chi2(3)      =     407.87
                                                  Prob > chi2     =     0.0000
Log likelihood = -489.20977                       Pseudo R2       =     0.2942

------------------------------------------------------------------------------
       m_bin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   .0681243   .1576183     0.43   0.666    -.2408019    .3770504
        var1 |  -.0100659   .0263047    -0.38   0.702    -.0616221    .0414903
        var2 |   .8696374   .0571742    15.21   0.000     .7575781    .9816968
       _cons |  -4.242807   .4044849   -10.49   0.000    -5.035583   -3.450031
------------------------------------------------------------------------------


Estimates of causal effects

             |   Estimate     Std Err   P>|z|   [95% Conf   Interval]
-------------+-------------------------------------------------------
         cde | -24.056417     .504428   0.000  -25.045096  -23.067739
         nde | -24.056417     .504428   0.000  -25.045096  -23.067739
         nie | -.13233181   .30629567   0.666  -.73267132   .46800769
         mte | -24.188749   .79251285   0.000  -25.742074  -22.635424

Note for outcome Y, treatment (exposure) A, and mediator M:
     controlled direct effect
          cde = E[Y(A=a, M=m)]- E[Y(A=a*, M=m)]
     natural direct effect
          nde = E[Y(A=a, M=m)]- E[Y(A=a*, M=m)]
     natural indirect effect
          nie = E[Y(A=a, M(A=a*))]- E[Y(A=a*, M(A=a*))]
     marginal total effect
          mte = E[Y(A=a, M(A=a))]- E[Y(A=a, M(A=a*))]

Where Y(A = a, M = m) is the value Y would take if the exposure is set to a
and the mediator is set to m. Y(A = a, M(A = a*)) is the value Y  would take
if the exposure is set to a and the mediator takes the vaulue it would when 
the exposure is set to a*.

. 
. *3. Full output when covariates specified
. paramed2 y_cont, avar(treat) mvar(m_bin) cvars(var1 var2)  m(1) yreg(linear) mreg(logistic)  full c(5, 10) // output
0 1

Model for the outcome

      Source |       SS           df       MS      Number of obs   =     1,000
-------------+----------------------------------   F(5, 994)       =   1337.42
       Model |  217271.294         5  43454.2587   Prob > F        =    0.0000
    Residual |   32296.107       994  32.4910533   R-squared       =    0.8706
-------------+----------------------------------   Adj R-squared   =    0.8699
       Total |  249567.401       999  249.817218   Root MSE        =    5.7001

--------------------------------------------------------------------------------
        y_cont |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         treat |  -12.90945   .5110227   -25.26   0.000    -13.91226   -11.90664
         m_bin |   3.292577   .5693594     5.78   0.000     2.175292    4.409861
_treat_X_m_bin |  -22.23864   .7217306   -30.81   0.000    -23.65493   -20.82235
          var1 |   .9897736   .0606257    16.33   0.000     .8708045    1.108743
          var2 |  -1.412419   .1084454   -13.02   0.000    -1.625228   -1.199611
         _cons |   5.556967   .8206041     6.77   0.000     3.946651    7.167282
--------------------------------------------------------------------------------


Model for the mediator

Iteration 0:   log likelihood = -693.14518
Iteration 1:   log likelihood = -506.13868
Iteration 2:   log likelihood = -489.97545
Iteration 3:   log likelihood = -489.21237
Iteration 4:   log likelihood = -489.20977

Logistic regression                               Number of obs   =       1000
                                                  LR chi2(3)      =     407.87
                                                  Prob > chi2     =     0.0000
Log likelihood = -489.20977                       Pseudo R2       =     0.2942

------------------------------------------------------------------------------
       m_bin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   .0681243   .1576183     0.43   0.666    -.2408019    .3770504
        var1 |  -.0100659   .0263047    -0.38   0.702    -.0616221    .0414903
        var2 |   .8696374   .0571742    15.21   0.000     .7575781    .9816968
       _cons |  -4.242807   .4044849   -10.49   0.000    -5.035583   -3.450031
------------------------------------------------------------------------------


Estimates of causal effects

             |   Estimate     Std Err   P>|z|   [95% Conf   Interval]
-------------+-------------------------------------------------------
        mcde | -35.148087   .50975379   0.000  -36.147205   -34.14897
       mpnde | -23.860326   .71321343   0.000  -25.258225  -22.462428
       mpnie |  .05607046   .13006626   0.666   -.1988594   .31100033
       mtnde | -24.239036   .71956381   0.000  -25.649381  -22.828691
       mtnie | -.32263925   .74640509   0.666  -1.7855932   1.1403147
         mte | -24.182965   4.7226287   0.000  -33.439318  -14.926613
        ccde | -35.148087   .50975379   0.000  -36.147205   -34.14897
       cpnde | -34.879229   .51120854   0.000  -35.881198   -33.87726
       cpnie |  .00259184   .00601887   0.667  -.00920514   .01438881
       ctnde | -34.896735   .51106353   0.000  -35.898419   -33.89505
       ctnie | -.01491388   .03454039   0.666  -.08261304   .05278528
         cte | -34.894143   .53866496   0.000  -35.949926  -33.838359

Note for outcome Y, treatment (exposure) A, and mediator M:
     marginal conditional direct effect
         mcde = E[Y(A=a, M=m)]- E[Y(A=a*, M=m)]
     marginal pure natural direct effect
        mpnde = E[Y(A=a, M=m)]- E[Y(A=a*, M=m)]
     marginal pure natural indirect effect
        mpnie = E[Y(A=a, M(A=a*))]- E[Y(A=a*, M(A=a*))]
     marginal total natural direct effect
        mtnde = E[Y(A=a, M(A=a))]- E[Y(A=a, M(A=a*))]
     marginal total natural indirect effect
        mtnie = E[Y(A=a, M(A=a*))]- E[Y(A=a*, M(A=a*))]
     marginal total effect
          mte = E[Y(A=a*, M(A=a))]- E[Y(A=a*, M(A=a*))]
     conditional controlled direct effect
         ccde = E[Y(A=a, M(A=a)]- E[Y(A=a*, M(A=a))]
     conditional pure natural direct effect
        cpnde = E[Y(A=a, M(A=a)]- E[Y(A=a, M(A=a*))]
     conditional pure natural indirect effect
        cpnie = E[Y(A=a, M=m)]- E[Y(A=a*, M=m)|C]
     conditional total natural direct effect
        ctnde = E[Y(A=a, M(A=a*))]- E[Y(A=a*, M(A=a*))|C]
     conditional total natural indirect effect
        ctnie = E[Y(A=a*, M(A=a))]- E[Y(A=a*, M(A=a*))|C]
     conditional total effect
          cte = E[Y(A=a, M(A=a)]- E[Y(A=a*, M(A=a))|C]

Where Y(A = a, M = m) is the value Y would take if the exposure is set to a
and the mediator is set to m. Y(A = a, M(A = a*)) is the value Y  would take
if the exposure is set to a and the mediator takes the vaulue it would when 
the exposure is set to a*.

. 
. log close 
      name:  <unnamed>
       log:  N:\Paramed\Command\Paramed\Testing\paramed_changes.log
  log type:  text
 closed on:  16 Jul 2019, 16:58:51
--------------------------------------------------------------------------------------------------------------------------------------
